//ЮФУ, ИКТИБ, МОП ЭВМ
//Программирование и основы теории алгоритмов
//Лаба 1.1 - программирование линейных алгоритмов
//КТбо1-6, Кравченко Александр Андреевич
//Задание А
//02.10.2023

#include <iostream>
using namespace std;
int main()
{
	int N;
	cin >> N;
	N = (N / 2) * 2 + 2;
	cout << N;
}